elua/elua/src/platform/lm3s/platform.c
u32 platform_pwm_setup( unsigned id, u32 frequency, unsigned duty )
{
  u32 pwmclk = platform_pwm_get_clock();
  u32 period;

  // Set pin as PWM
  GPIOPinTypePWM( pwm_ports[ id ], pwm_pins[ id ] );
  // Compute period
  period = pwmclk / frequency;
  // Set the period
  PWMGenConfigure( PWM_BASE, pwm_gens[ id >> 1 ], PWM_GEN_MODE_UP_DOWN | PWM_GEN_MODE_NO_SYNC );
  PWMGenPeriodSet( PWM_BASE, pwm_gens[ id >> 1 ], period );
  // Set duty cycle
  PWMPulseWidthSet( PWM_BASE, pwm_outs[ id ], ( period * duty ) / 100 );
  // Return actual frequency
  return pwmclk / period;
}

u32 platform_pwm_op( unsigned id, int op, u32 data )
{
  u32 res = 0;

  switch( op )
  {
    case PLATFORM_PWM_OP_SET_CLOCK:
      res = platform_pwm_set_clock( data );
      break;

    case PLATFORM_PWM_OP_GET_CLOCK:
      res = platform_pwm_get_clock();
      break;

    case PLATFORM_PWM_OP_START:
      PWMOutputState( PWM_BASE, 1 << id, true );
      PWMGenEnable( PWM_BASE, pwm_gens[ id >> 1 ] );
      break;

    case PLATFORM_PWM_OP_STOP:
      PWMOutputState( PWM_BASE, 1 << id, false );
      PWMGenDisable( PWM_BASE, pwm_gens[ id >> 1 ] );
      break;
  }

  return res;
}

// *****************************************************************************
// CPU specific functions

void platform_cpu_enable_interrupts()
{
  IntMasterEnable();
}

void platform_cpu_disable_interrupts()
{
  IntMasterDisable();
}

// *****************************************************************************
// ADC specific functions and variables
// NOTES: HWREGBITW should be replaced with some similar function that will work for other platforms


const static u32 adc_ctls[] = { ADC_CTL_CH0, ADC_CTL_CH1, ADC_CTL_CH2, ADC_CTL_CH3 };
const static u32 adc_ints[] = { INT_ADC0, INT_ADC1, INT_ADC2, INT_ADC3 };

struct platform_adc_state adc_state[ NUM_ADC ];

void platform_adc_stop_burst( struct platform_adc_state *s )
{
  ADCSequenceDisable( ADC_BASE, s->id );
  TimerControlTrigger( timer_base[s->timer_id], TIMER_A, false );
}

// Initialize Configuration and Buffers
void adc_init_state( struct platform_adc_state *s, unsigned id )
{
  // Initialize Configuration
  s->op_pending = 0;
  s->nonblocking = 0;
  s->burst = 0;
  s->data_ready = 0;
  s->smooth_ready = 0;
  
  s->id = id;
  s->timer_id = 0;
  s->burstlen = 1;
  s->burstidx = 0;
  s->smoothlen = 1;
  s->smoothidx = 0;
  s->sample = 0;
  
  // Data Configuration
  s->smoothavg = 0;
  s->smoothsum = 0;
  
  // Buffer initialization
  s->smoothbuf = malloc( s->smoothlen * sizeof( u16 ) );
}

int adc_update_smoothing(struct platform_adc_state *s, u8 len)
{
  u8 i;
  
  if( len !=  s->smoothlen )
  {
    s->smoothlen = len; 
    
    // Free old buffer space
    if ( s->smoothbuf != NULL )
      free( s->smoothbuf );
    
    // Reset sum, avg, index location
    s->smoothidx = 0;
    s->smoothavg = 0;
    s->smoothsum = 0;
    s->smooth_ready = 0;

    // Allocate and zero new smoothing buffer
    if( ( s->smoothbuf = malloc( s->smoothlen * sizeof( u16 ) ) ) == NULL )
    {
      return 1;
    }
    
    for( i = 0; i < s->smoothlen; i ++ )
      s->smoothbuf[ i ] = 0;
  }
  return 0;
}

void adc_process_data( struct platform_adc_state *s, u16 samplevalue )
{
  // Take just acquired sample and do smoothing / burst buffering
  if ( s->smoothlen > 1 )
  {
    if( s->smoothidx ==  s->smoothlen )
    {
      s->smoothidx = 0;
      s->smooth_ready = 1;
    }
  
    // Subtract Oldest Value from Sum
    s->smoothsum -= s->smoothbuf[ s->smoothidx ];
  
    // Replace Oldest Value in Buffer
    s->smoothbuf[ s->smoothidx ] = ( u16 ) samplevalue;
  
    // Add New Sample to Sum
    s->smoothsum += s->smoothbuf[ s->smoothidx ];
  
    s->smoothidx++;
  
    // Calculate Average
    if ( ( s->smoothlen != 0 ) && !( s->smoothlen & ( s->smoothlen - 1 ) ) )
      s->smoothavg = s->smoothsum >> intlog2( s->smoothlen );
    else
      s->smoothavg = s->smoothsum / s->smoothlen;
    
    s->sample = ( u16 ) s->smoothavg;
  }
  else
    s->sample = samplevalue;
    
  // Increment buffer position, unless we're waiting on the smoothing filter to warm up
  if ( ( ( s->smooth_ready == 1 &&  s->smoothlen > 1 ) || s->smoothlen == 1 ) && ( s->burst == 1 )  )
         s->burstbuf[ s->burstidx++ ] = s->sample;

  // If we have enough samples, clean up / finish
  if ( s->burstidx ==  s->burstlen  || s->burst == 0 )
  {
    s->data_ready = 1;
    s->op_pending = 0;
    
    if ( s->burst == 1 )
    {
      // Disable Burst Mode
      platform_adc_stop_burst( s );
      s->burst = 0;
    }
  }
}

// Handle ADC interrupts
void ADCIntHandler( void )
{
  unsigned long rawSample;
  unsigned id;
  
  // Check each sequence for a pending sample
  for( id = 0; id < NUM_ADC; id ++ )
  {
    if( ADCIntStatus(ADC_BASE, id, false) )
    {      
      // Clear Interrupt & Get Sample
      ADCIntClear(ADC_BASE, id);
      ADCSequenceDataGet(ADC_BASE, id, &rawSample);
      
      // Process Received Sample
      adc_process_data(&adc_state[ id ], (u16) rawSample);
    }
  }
}

static void adcs_init()
{
  unsigned id;
  
	SysCtlPeripheralEnable(SYSCTL_PERIPH_ADC);

	for( id = 0; id < NUM_ADC; id ++ )
	{
    // Init ADC State Struct
    adc_init_state( &adc_state[ id ], id );
	  
  	// Make sure sequencer is disabled before making changes
    ADCSequenceDisable( ADC_BASE, id );

    // Conversion initiated on processor trigger
    ADCSequenceConfigure( ADC_BASE, id, ADC_TRIGGER_PROCESSOR, id ) ;

    // Samples go into sequencer of the same number as input channel
   	ADCSequenceStepConfigure( ADC_BASE, id, 0, ADC_CTL_IE | ADC_CTL_END | adc_ctls[id] );

    ADCIntEnable(ADC_BASE, id);
    IntEnable(adc_ints[id]);

    // Restart Sequencer
    ADCSequenceEnable( ADC_BASE, id );
	}
}

u32 platform_adc_op( unsigned id, int op, u32 data )  // Move to common?
{
  // Do we really need 32-bit in and out?
  u32 res = 0;

  switch( op )
  {
    case PLATFORM_ADC_GET_MAXVAL:
      res = pow( 2,ADC_BIT_RESOLUTION ) - 1;
      break;

    case PLATFORM_ADC_GET_SMOOTHING:
      res = adc_state[ id ].smoothlen;
      break;

    case PLATFORM_ADC_SET_SMOOTHING:
      // If buffer length changes, alloc new buffer, and reset position
      adc_update_smoothing( &adc_state[ id ], ( u8 )data );
      break;
  }
  return res;
}

